---
kind: type
id: T:Autodesk.Revit.DB.ValueAtPointBase
source: html/67c49547-b5b9-59ad-8106-65d90886a381.htm
---
# Autodesk.Revit.DB.ValueAtPointBase

A base class representing storage of values at a given point.

## Syntax (C#)
```csharp
public class ValueAtPointBase : IDisposable
```

## Remarks
This class stores a set of measurements and corresponding mapped flags.
 The flags are defined in the enumerated type ValueAtPointFlags.